//	Создать класс книги Book, в котором хранится название, автор и год издания книги.
//	В главной функции создать коллекцию книг(приложение А). Продемонстрировать
//	сортировку книг по автору(первичный ключ) и названию(вторичный ключ).
//	Продемонстрировать поиск в коллекции : найти все книги, год издания которых
//	находится в указанном диапазоне. Использовать контейнер std::vector и функторы.
//	Подсчитать и вывести на консоль количество всех книг новее 2009 года, используя
//	только стандартные алгоритмы и функторы STL(подcказка : std::count_if, std::greater<>, std::bind2nd).